{"name": "Actress Patricia Brake dies aged 79 after long illness - BBC News", "link": "https://www.bbc.com/news/entertainment-arts-61624478", "content": "actress patricia brake, known for her roles in bbc sitcom porridge and itv drama manhunt, has died aged 79 after being diagnosed with cancer, her family has said. her agent scott marshall partners said brake would be \"sadly missed\" by her friends, family, colleagues and fans. brake's 60-year career saw her play roles in television soaps coronation street, emmerdale and eastenders. but she was best known to viewers in the 1970s for her role in porridge. brake played ingrid, the daughter of ronnie barker's norman stanley fletcher and she reprised the same role in going straight, alongside richard beckinsale and nicholas lyndhurst. over the years, she had roles in midsomer murders, doctors, casualty, holby city, 2point4 children and eldorado. she worked with the two ronnies and morecambe and wise and in the late 1970s was seen every saturday night as eth in the glums. paying tribute to brake, her agent described her as \"a soap stalwart\" who would be \"forever remembered as an outstanding feed for comedy greats\". born in bath in 1942, she went to study at the bristol old vic theatre school when she was 16 years old. she found success in repertory theatre and joined the royal shakespeare company in stratford when still a teenager. during that season, she played hermia in peter hall's a midsummer night's dream, alongside dames judi dench and diana rigg. she continued to work until last year when she played a rape victim in itv drama manhunt. she also worked in shows such as truth seekers by nick frost and defending the guilty by alex mcbride. brake's first marriage was to actor robert mcbain while she subsequently married michael kennedy - she is survived by her children, step-children and grand-children. why \"the inane office 'fun' of yesteryear has wholly passed\" it's a straightforward street food with an iconic theme song gravity batteries could solve one of renewable energy's biggest problems © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}