{"name": "Franky Zapata French jetpack inventor injured in lake crash - BBC News", "link": "https://www.bbc.com/news/world-europe-61622794", "content": "the french inventor franky zapata has been injured after his homemade jetpack, called a flyboard, crashed into a lake in the town of biscarrosse. mr zapata was taking part in an exhibition event when he appeared to lose control of his invention and fell about 15 meters into lake biscarosse. he was taken to hospital and officials said he was recovering well. the former jet-ski champion rose to fame after crossing the english channel on his device in 2019. in video footage posted to social media, mr zapata can be seen rising in a spin onboard his invention, before seemingly losing control of the flyboard and spiralling into the lake. the french media outlet sud ouest reported that the 40-year-old was conscious as emergency services pulled him from the lake and officials later told reporters that he was showing \"good sensitivity and motor skills\" while under observation in hospital. mr zapata, nicknamed \"the flying man\" by french media, had been due to perform several times over the course of the weekend, but biscarosse mayor hélène larrezet told local media that his appearances have been cancelled in the wake of the accident. the flyboard, which mr zapata designed, built and piloted himself, is a kind of surfboard powered by four micro-turbines and can reach speeds of up to 87 mph (140kmh). in 2019 he received widespread attention after he partook in the annual bastille day parade in paris, when he flew above the military display on his futuristic jetpack. three weeks later he completed his crossing of the english channel, completing the 22-mile (35.4km) journey in just 22 minutes. mr zapata, who had failed in his first attempt to cross the channel a week before after complications with refuelling, called his achievement \"crazy\". why \"the inane office 'fun' of yesteryear has wholly passed\" it's a straightforward street food with an iconic theme song gravity batteries could solve one of renewable energy's biggest problems © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}