{"name": "Palme dOr Triangle of Sadness wins top prize in Cannes for Ruben Ostlund - BBC News", "link": "https://www.bbc.com/news/world-europe-61621754", "content": "a biting social satire - complete with a lengthy vomiting scene - has taken the top prize at the cannes festival. ruben ostlund's triangle of sadness - which sees models and the ultra-rich have their status undermined by unexpected events - was awarded the palme d'or on saturday. it is the second time the swedish director has won the award, having also picked it up in 2017 for the square. the best director prize was won by south korea's park chan-wook. park - known for 2003 thriller oldboy - won with erotic crime film decision to leave. it was a strong night for south korea, with the best actor gong going to song kang-ho for broker. song came to international attention with his performance in 2019's oscar-winning parasite. ostlund - who has been dubbed the \"king of cringe\" - told reporters he had set out to make a film which would get people talking. \"when we started to make this film i think we had one goal - to really, really try to make an exciting film for the audience and bring thought-provoking content,\" ostlund said, adding: \"we wanted to entertain them, we wanted them to ask themselves questions, we wanted them to after the screening go out and have something to talk about.\" his film has certainly got a reaction from the audience, with news agency afp noting that one scene in particular was \"leaving viewers either howling with laughter or turning green\" during its premiere. triangle of sadness begins with two models - played by british actor harris dickinson and south african charlbi dean - who go on a luxury cruise. but unexpected events mean they find themselves stranded - with the need to survive upending the social order. entertainment magazine variety notes that while the film \"makes you laugh\", ostlund \"also makes you think\". \"no matter what sphere he tackles, we're bound to see the world differently,\" it says in its review. why \"the inane office 'fun' of yesteryear has wholly passed\" it's a straightforward street food with an iconic theme song gravity batteries could solve one of renewable energy's biggest problems © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}